<details ><summary>apply for dev 2025-06-11 23:54:20 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project diggerhq/states-test#dev has been locked by PR #5
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.example_secret will be created
  + resource "aws_ssm_parameter" "example_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Example secret parameter"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/example/secret"
      + tags           = {
          + "Environment" = "dev"
        }
      + tags_all       = {
          + "Environment" = "dev"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_ssm_parameter.example_secret: Creating...
aws_ssm_parameter.example_secret: Creation complete after 1s [id=/dev/example/secret]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>

</details>